Tekla Open API Reference for Tekla Structures 2025
SingleRebar.GetRebarSet Method
 Gets the parent RebarSet of the single rebar.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSet GetRebarSet()
Public Function GetRebarSet As RebarSet
Return Value
Type: RebarSet
The parent RebarSet, or null if no parent rebar set.
See Also
Reference
SingleRebar Class
Tekla.Structures.Model Namespace